---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityText
source: html/52a24fff-b5bd-67fb-3857-7acd468931fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityText Property

"Shadows intensity text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyShadowsIntensityText { get; }
```